cmsis-svd/cmsis-svd/data/Atmel/ATSAM3N00A.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>EFC</name>
      <version>6450G</version>
      <description>Embedded Flash Controller</description>
      <prependToName>EFC_</prependToName>
      <baseAddress>0x400E0A00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EFC</name>
        <value>6</value>
      </interrupt>
      <registers>
        <register>
          <name>FMR</name>
          <description>EEFC Flash Mode Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FWS</name>
              <description>Flash Wait State</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCOD</name>
              <description>Sequential Code Optimization Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FAM</name>
              <description>Flash Access Mode</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FCR</name>
          <description>EEFC Flash Command Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FCMD</name>
              <description>Flash Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GETD</name>
                  <description>Get Flash Descriptor</description>
                  <value>0x00</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP</name>
                  <description>Write page</description>
                  <value>0x01</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPL</name>
                  <description>Write page and lock</description>
                  <value>0x02</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EWP</name>
                  <description>Erase page and write page</description>
                  <value>0x03</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EWPL</name>
                  <description>Erase page and write page then lock</description>
                  <value>0x04</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EA</name>
                  <description>Erase all</description>
                  <value>0x05</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SLB</name>
                  <description>Set Lock Bit</description>
                  <value>0x08</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLB</name>
                  <description>Clear Lock Bit</description>
                  <value>0x09</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GLB</name>
                  <description>Get Lock Bit</description>
                  <value>0x0A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SGPB</name>
                  <description>Set GPNVM Bit</description>
                  <value>0x0B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CGPB</name>
                  <description>Clear GPNVM Bit</description>
                  <value>0x0C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GGPB</name>
                  <description>Get GPNVM Bit</description>
                  <value>0x0D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STUI</name>
                  <description>Start Read Unique Identifier</description>
                  <value>0x0E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPUI</name>
                  <description>Stop Read Unique Identifier</description>
                  <value>0x0F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCALB</name>
                  <description>Get CALIB Bit</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FARG</name>
              <description>Flash Command Argument</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FKEY</name>
              <description>Flash Writing Protection Key</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>The 0x5A value enables the command defined by the bits of the register. If the field is written with a different value, the write is not performed and no action is started.</description>
                  <value>0x5A</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FSR</name>
          <description>EEFC Flash Status Register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <fields>
            <field>
              <name>FRDY</name>
              <description>Flash Ready Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FCMDE</name>
              <description>Flash Command Error Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FLOCKE</name>
              <description>Flash Lock Error Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FRR</name>
          <description>EEFC Flash Result Register</description>
          <addressOffset>0x0000000C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FVALUE</name>
              <description>Flash Result Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
